# Напишіть програму, яка зчитує довжину основи та висоту прямокутного трикутника (цілі числа), 
# обчислює площу і друкує її значення на екрані у відформатованому вигляді (два символи після 
# десяткової крапки). Кожен параметр вводиться на окремому рядку.

# Вхідні дані:

# 3
# 4
# Вихідні дані:

# 6.00

# *================= Code =====================
# Зчитуємо довжину основи та висоту 
print("Введіть довжину основи прямокутного трикутника")
base_length = int(input())
print("Введіть висоту прямокутного трикутника")
height = int(input())

# Обчислюємо площу прямокутного трикутника
area = 0.5 * base_length * height

# Виводимо результат відформатовано з двома символами після десяткової крапки
print("\nОбчислена площа прямокутного трикутника дорівнює:")
print("{:.2f}".format(area))