# Напишіть програму для друку цілих чисел від 0 до n та від n до 0 із виведенням 
# біля кожного числа кількості символів #, що дорівнює значенню числа.

# Вхідні дані:

# 6
# Вихідні дані:
# 1 #
# 2 ##
# 3 ###
# 4 ####
# 5 #####
# 6 ######
# 5 #####
# 4 ####
# 3 ###
# 2 ##
# 1 #

#*============Code================

# Зчитуємо ціле число n 
n = int(input("Введіть ціле число n: "))

# Виводимо цілі числа від n до 0 і кількість символів '#'
for i in range(0, n, 1):
    print(f"{i} {'#' * i}")
for i in range(n, 0, -1):
    print(f"{i} {'#' * i}")