# Користувач вводить кількість навчальних предметів n, а потім, 
# відповідно, оцінки учня з n навчальних предметів. Визначте середню оцінку.

# Вхідні дані:

# 5
# 10
# 11
# 9
# 8
# 10
# Вихідні дані:

# 9.60

#*============Code================
n = int(input("Введіть кількість навчальних предметів: "))
avarage = 0
mark = [0]*n

for i in range(0, n, + 1):
    mark[i] = int(input(f"Введіть оцінку з {i + 1} навчального предмета: "))
    
for i in range(n):
    avarage = avarage + mark[i]
avarage = avarage / n

print(f"Cередня оцінка дорівнює: {avarage}")
print("list mark", mark)

