# Дано два цілих числа a і b (a ≤ b). Виведіть всі числа від a до b включно.

# Вхідні дані:

# 1
# 12
# Вихідні дані:

# 1 2 3 4 5 6 7 8 9 10 11 12

#*============Code================

# Зчитуємо два цілих числа a і b з клавіатури
print("Введіть два числа і крок, якщо перше число більше другого, крок буде визначено програмою автоматично зі знаком -")
a = int(input("Введіть перше число: "))
b = int(input("Введіть друге число: "))
step = int(input("Введіть крок: "))
if a > b: # Визначаємо, що у цьому випадку крок буде від'ємний та зменшуємо на 1 кінцевий індекс
    step = - step
    b = b - 1
if a < b: # Визначаємо, що при додатньому кроку необхідно збільшити на 1 кінцевий індекс
    b = b + 1
# Виводимо всі числа від a до b включно
for i in range(a, b, step):
    print(i, end=" ")