# Напишіть програму, яка зчитує значення двох змінних a і b, потім змінює їх значення місцями 
# (тобто в змінній a має бути записано те, що раніше зберігалося в b, а в змінній b записано те, 
#  що раніше зберігалося в a). Потім виведіть значення змінних. Виконайте подане завдання 
# без використання третьої змінної. У якому порядку значення змінних були введені,
# у тому ж порядку повинні і виводитися.

# Вхідні дані:

# 34
# 190
# Вихідні дані:

# 190
# 34

#*============Code================
# Зчитуємо значення змінних a і b
a = int(input("Введить перше  число "))
b = int(input("Введить друге число "))

# Виводимо значення перед обміном
print("Значення до обміну:")
print("a =", a)
print("b =", b)

# Обмін значень без використання третьої змінної
a = a + b
b = a - b
a = a - b

# Виводимо значення після обміну
print("\nЗначення після обміну:")
print("a =", a)
print("b =", b)