# Напишіть програму для друку цілих чисел з нулями ліворуч, 
# якщо введене число має у своєму записі менше 5 розрядів.

# Вхідні дані:

# 125
# 20
# 12805
# Вихідні дані:

# 00125
# 00020
# 12805

# *================= Code =====================
# Зчитуємо числа
number1 = int(input("Введіть перше ціле число не більше 5 цифр"))
number2 = int(input("Введіть друге ціле число не більше 5 цифр"))
number3 = int(input("Введіть третє ціле число не більше 5 цифр"))

# Виводимо числа з нулями ліворуч, якщо менше 5 розрядів
print("\nФорматований вивід чисел з нулями ліворуч, якщо введене число має у своєму записі менше 5 розрядів.")
print(f"Введено: {number1}  => Форматований вивід: ""{:05d}".format(number1))
print(f"Введено: {number2}  => Форматований вивід: ""{:05d}".format(number2))
print(f"Введено: {number3}  => Форматований вивід: ""{:05d}".format(number3))