# Напишіть програму, щоб надрукувати цілі числа із ∗ справа, якщо введене число має у своєму записі менше 7 розрядів.

# Вхідні дані:

# 23
# 1400231
# -16
# Вихідні дані:

# 23*****
# 1400231
# -16****

# *================= Code =====================

#  Зчитуємо числа з клавіатури
number1 = int(input("Введіть перше ціле число не більше 7 цифр"))
number2 = int(input("Введіть друге ціле число не більше 7 цифр"))
number3 = int(input("Введіть третє ціле число не більше 7 цифр"))

# Виводимо числа з '*' справа, якщо менше 7 розрядів
print("{:<7}".format(number1))
print("{:<7}".format(number2))
print("{:<7}".format(number3))