# Відомі дві швидкості: одна в кілометрах за годину, інша - в метрах за секунду. Яка з швидкостей більше?

# Вхідні дані:

# 60
# 18
# Вихідні дані:

# 18

#*============Code================

# Зчитуємо швидкості з клавіатури
speed_kmph = float(input("Введіть швидкість в км/год: "))
speed_mps = float(input("Введіть швидкість в м/с: "))
trans_speed_kmph = speed_kmph * 1000 / 3600
print("trans_speed_kmph", trans_speed_kmph)
# Порівнюємо швидкості та виводимо більшу
if trans_speed_kmph > speed_mps:
    print(f"<Більша швидкість {speed_kmph} км/год")
else:
    print(f"<Більша швидкість {speed_mps} м/с")