# У чемпіонаті з футболу команді за виграш дається 3 очка, за програш - 0, 
# за нічию - 1. Відомо кількість очок, отриманих командою за гру. 
# Вивести результат гри у вигляді відповідних слів: «виграш», «програш» або «нічия».

# Вхідні дані:

# 3
# 1
# 0
# Вихідні дані:

# win
# draw
# lose

#*============Code================

# Зчитуємо кількість очок від користувача
points = int(input("Введіть кількість очок 0/1/3: "))

# Визначаємо результат гри
if points == 3:
    result = "win"
elif points == 1:
    result = "draw"
else:
    result = "lose"

# Виводимо результат
print(result)