# Напишіть програму, в якій користувач вводить значення температури, і, 
# якщо це значення менше або дорівнює 0 градусів Цельсія, необхідно вивести 
# повідомлення A cold, isn’t it?. Якщо ж температура становить більше 0 
# і менше 10 градусів Цельсія повідомлення буде Cool., у інших випадках Nice weather we’re having..

# Вхідні дані:

# 12.5
# -5
# 9
# Вихідні дані:

# Nice weather we're having.
# A cold, isn't it?
# Cool.

#*============Code================

# Зчитуємо значення температури від користувача
temperature = float(input("Введіть значення температури: "))

# Перевіряємо температуру і виводимо відповідне повідомлення
if temperature <= 0:
    print("A cold, isn't it?")
elif 0 < temperature < 10:
    print("Cool.")
else:
    print("Nice weather we're having.")
