# Напишіть програму, яка виводить назви введених чисел. Користувач вводить ціле число. 
# Якщо це число або 1 або 2 або 3, то виводиться повідомлення - 
# назва числа, відповідно, One, Two, Three. В усіх інших випадках виводиться слово Unknown.

# Вхідні дані:

# 20
# 1
# 2
# 3
# Вихідні дані:

# Unknown
# One
# Two
# Three

#*============Code================

# Зчитуємо ціле число від користувача
number = int(input("Введіть число від 1 до 3: "))

# Виводимо назву числа згідно умов
if number == 1:
    print("One")
elif number == 2:
    print("Two")
elif number == 3:
    print("Three")
else:
    print("Unknown")