# У будинку кілька під’їздів. У кожному під’їзді однакова кількість квартир. 
# Квартири нумеруються підряд, починаючи з одиниці. Чи може в деякому під’їзді 
# перша квартира мати номер x, а остання - номер y? Вводяться два натуральних 
# числа x і y (x ≤ y), що не перевищують 10000. Виведіть слово Yes, якщо таке 
# можливо, і No у протилежному випадку.

# Вхідні дані:

# 111
# 15
# Вихідні дані:

# Yes  - ??????????????

#*============Code================

# Зчитуємо два натуральних числа x і y з клавіатури
x = int(input())
y = int(input())

# Перевіряємо, чи можливо мати такі номери квартир у під'їзді
if (y - x) % (y - 1) == 0:
    print("Yes")
else:
    print("No")
print(f"(y - x) % (y - 1) = {(y - x) % (y - 1)}")
print(f" x = {x}")
print(f" y = {y}")