# Користувач вводить дві різних англійські літери в окремих рядках. 
# Напишіть програму, яка виводить повідомлення про місце розташування 
# однієї літери відносно іншої у алфавіті.

# Вхідні дані:

# z
# a
# Вихідні дані:

# z is not less than a


#*============Code================

# Зчитуємо дві різні англійські літери від користувача
letter1 = input("Введіть одну англійську літеру: ")
letter2 = input("Введіть другу англійську літеру: ")

# Порівнюємо літери та виводимо повідомлення
if letter1 < letter2:
    print(f"{letter1} is less than {letter2}")
elif letter1 > letter2:
    print(f"{letter1} is greater than {letter2}")
else:
    print(f"{letter1} and {letter2} are the same")